In [37]:
import pandas as pd

In [38]:
titanic = pd.read_csv('titanic.csv')

In [39]:
titanic.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [40]:
from matplotlib import pyplot as plt

In [41]:
from sklearn.preprocessing import LabelEncoder

In [42]:
le = LabelEncoder()

In [47]:
titanic['gender'] = le.fit_transform(titanic.Sex)

In [48]:
titanic    #male = 1 female = 0

     Survived  Pclass     Sex   Age     Fare  gender
0           0       3    male  22.0   7.2500       1
1           1       1  female  38.0  71.2833       0
2           1       3  female  26.0   7.9250       0
3           1       1  female  35.0  53.1000       0
4           0       3    male  35.0   8.0500       1
..        ...     ...     ...   ...      ...     ...
886         0       2    male  27.0  13.0000       1
887         1       1  female  19.0  30.0000       0
888         0       3  female   NaN  23.4500       0
889         1       1    male  26.0  30.0000       1
890         0       3    male  32.0   7.7500       1

[891 rows x 6 columns]

In [49]:
titanic.drop(['Sex'],axis='columns',inplace=True)

In [50]:
titanic

     Survived  Pclass   Age     Fare  gender
0           0       3  22.0   7.2500       1
1           1       1  38.0  71.2833       0
2           1       3  26.0   7.9250       0
3           1       1  35.0  53.1000       0
4           0       3  35.0   8.0500       1
..        ...     ...   ...      ...     ...
886         0       2  27.0  13.0000       1
887         1       1  19.0  30.0000       0
888         0       3   NaN  23.4500       0
889         1       1  26.0  30.0000       1
890         0       3  32.0   7.7500       1

[891 rows x 5 columns]

In [51]:
#now find mean value to analyze the data

In [52]:
titanic.groupby('Survived').mean()

            Pclass        Age       Fare    gender
Survived
0         2.531876  30.626179  22.117887  0.852459
1         1.950292  28.343690  48.395408  0.318713

In [53]:
target = titanic.Survived

In [56]:
inputs = titanic[['Pclass','Fare','gender']]

In [58]:
inputs.head()

   Pclass     Fare  gender
0       3   7.2500       1
1       1  71.2833       0
2       3   7.9250       0
3       1  53.1000       0
4       3   8.0500       1

In [59]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [60]:
from sklearn.tree import DecisionTreeClassifier

In [61]:
from sklearn.model_selection import train_test_split

In [85]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.1)

In [94]:
model = DecisionTreeClassifier()

In [95]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [96]:
model.predict(X_test)

array([1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1,
       1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1,
       0, 0], dtype=int64)

In [97]:
model.score(X_test,y_test)

0.8222222222222222